#Задайте список из вещественных чисел. Напишите программу,
#которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
#Пример:
#o [1.1, 1.2, 3.1, 5, 10.01] => 0.19



list_float = [1.1, 1.2, 3.1, 5, 10.01] 
min = 0
max = 1
for i in list_float:
    if (i - int(i)) >= min:
        min = i - int(i)
    if (i - int(i)) <= max:
        max = i - (i)
        result = - max + min
print(result)


